In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['ayush' ,'harry' ,'rohan' ,'shubh'],
    "marks" : [92 , 34 , 45 , 17],
    "city" : ['hazaribag', 'rampur' , 'bareilly' , 'noida']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

    name  marks       city
0  ayush     92  hazaribag
1  harry     34     rampur
2  rohan     45   bareilly
3  shubh     17      noida

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index = False)

In [7]:
df.head(2)

    name  marks       city
0  ayush     92  hazaribag
1  harry     34     rampur

In [8]:
df.tail(2)

    name  marks      city
2  rohan     45  bareilly
3  shubh     17     noida

In [9]:
df.describe()

           marks
count   4.000000
mean   47.000000
std    32.135131
min    17.000000
25%    29.750000
50%    39.500000
75%    56.750000
max    92.000000

In [10]:
ser = pd.Series(np.random.rand(34))

In [11]:
type(ser)

pandas.core.series.Series

In [12]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [13]:
type(newdf)

pandas.core.frame.DataFrame

In [14]:
newdf.describe()
newdf.head()

          0         1         2         3         4
0  0.335899  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [15]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [16]:
newdf[0][0] ="harry"

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5880\4269165959.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] ="harry"
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5880\4269165959.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] ="harry"

In [17]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [18]:
newdf.head()

          0         1         2         3         4
0     harry  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [19]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [20]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [21]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       harry  0.319166  0.690719  0.525020  0.636423
1    0.455463  0.579652  0.586463  0.770397  0.462458
2    0.622877  0.084373  0.488963  0.146209  0.987950
3    0.178666  0.906861  0.352426  0.748274  0.603342
4    0.796913  0.532281  0.972676  0.297624  0.939657
..        ...       ...       ...       ...       ...
329  0.169079  0.452387  0.037472  0.778799  0.473752
330   0.66589  0.666190  0.167143  0.763646  0.474444
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371
333  0.778394  0.535520  0.490037  0.865827  0.561360

[334 rows x 5 columns]>

In [22]:
newdf[0][0] = 0.3

In [23]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.319166  0.690719  0.525020  0.636423
1    0.455463  0.579652  0.586463  0.770397  0.462458
2    0.622877  0.084373  0.488963  0.146209  0.987950
3    0.178666  0.906861  0.352426  0.748274  0.603342
4    0.796913  0.532281  0.972676  0.297624  0.939657
..        ...       ...       ...       ...       ...
329  0.169079  0.452387  0.037472  0.778799  0.473752
330   0.66589  0.666190  0.167143  0.763646  0.474444
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371
333  0.778394  0.535520  0.490037  0.865827  0.561360

[334 rows x 5 columns]>

In [24]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.455463,0.622877,0.178666,0.796913,0.385347,0.911815,0.999352,0.73983,0.044256,...,0.796472,0.007075,0.691169,0.197174,0.488548,0.169079,0.66589,0.03478,0.281096,0.778394
1,0.319166,0.579652,0.084373,0.906861,0.532281,0.84652,0.638167,0.906886,0.56799,0.656559,...,0.619955,0.489943,0.399786,0.335115,0.483548,0.452387,0.66619,0.248195,0.469452,0.53552
2,0.690719,0.586463,0.488963,0.352426,0.972676,0.98727,0.376394,0.798699,0.689746,0.196785,...,0.040919,0.847451,0.28769,0.316801,0.666304,0.037472,0.167143,0.46711,0.739213,0.490037
3,0.52502,0.770397,0.146209,0.748274,0.297624,0.151433,0.968284,0.747991,0.223954,0.473536,...,0.274335,0.787698,0.312922,0.384179,0.495438,0.778799,0.763646,0.752645,0.530699,0.865827
4,0.636423,0.462458,0.98795,0.603342,0.939657,0.374345,0.444814,0.135994,0.119321,0.666306,...,0.631341,0.745437,0.673402,0.193412,0.159098,0.473752,0.474444,0.469592,0.141371,0.56136

In [25]:
newdf.head()

          0         1         2         3         4
0       0.3  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [26]:
newdf.sort_index(axis=1, ascending = False)

            4         3         2         1         0
0    0.636423  0.525020  0.690719  0.319166       0.3
1    0.462458  0.770397  0.586463  0.579652  0.455463
2    0.987950  0.146209  0.488963  0.084373  0.622877
3    0.603342  0.748274  0.352426  0.906861  0.178666
4    0.939657  0.297624  0.972676  0.532281  0.796913
..        ...       ...       ...       ...       ...
329  0.473752  0.778799  0.037472  0.452387  0.169079
330  0.474444  0.763646  0.167143  0.666190   0.66589
331  0.469592  0.752645  0.467110  0.248195   0.03478
332  0.141371  0.530699  0.739213  0.469452  0.281096
333  0.561360  0.865827  0.490037  0.535520  0.778394

[334 rows x 5 columns]

In [27]:
newdf.head()

          0         1         2         3         4
0       0.3  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [28]:
type(newdf[0])

pandas.core.series.Series

In [29]:
newdf2 = newdf

In [30]:
newdf2[0][0] = 9783

In [31]:
newdf

            0         1         2         3         4
0        9783  0.319166  0.690719  0.525020  0.636423
1    0.455463  0.579652  0.586463  0.770397  0.462458
2    0.622877  0.084373  0.488963  0.146209  0.987950
3    0.178666  0.906861  0.352426  0.748274  0.603342
4    0.796913  0.532281  0.972676  0.297624  0.939657
..        ...       ...       ...       ...       ...
329  0.169079  0.452387  0.037472  0.778799  0.473752
330   0.66589  0.666190  0.167143  0.763646  0.474444
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371
333  0.778394  0.535520  0.490037  0.865827  0.561360

[334 rows x 5 columns]

In [32]:
newdf.loc[0,0]=654

In [33]:
newdf.head(2)

          0         1         2         3         4
0       654  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458

In [34]:
newdf.columns = list("ABCDE")

In [35]:
newdf.head()

          A         B         C         D         E
0       654  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [36]:
newdf.loc[0,0]=653

In [37]:
newdf.head()

          A         B         C         D         E      0
0       654  0.319166  0.690719  0.525020  0.636423  653.0
1  0.455463  0.579652  0.586463  0.770397  0.462458    NaN
2  0.622877  0.084373  0.488963  0.146209  0.987950    NaN
3  0.178666  0.906861  0.352426  0.748274  0.603342    NaN
4  0.796913  0.532281  0.972676  0.297624  0.939657    NaN

In [38]:
newdf =newdf.drop(0,axis=1)

In [39]:
newdf.loc[0,'A'] = 6543

In [40]:
newdf.head

<bound method NDFrame.head of             A         B         C         D         E
0        6543  0.319166  0.690719  0.525020  0.636423
1    0.455463  0.579652  0.586463  0.770397  0.462458
2    0.622877  0.084373  0.488963  0.146209  0.987950
3    0.178666  0.906861  0.352426  0.748274  0.603342
4    0.796913  0.532281  0.972676  0.297624  0.939657
..        ...       ...       ...       ...       ...
329  0.169079  0.452387  0.037472  0.778799  0.473752
330   0.66589  0.666190  0.167143  0.763646  0.474444
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371
333  0.778394  0.535520  0.490037  0.865827  0.561360

[334 rows x 5 columns]>

In [41]:
newdf.head()

          A         B         C         D         E
0      6543  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [42]:
newdf.head()

          A         B         C         D         E
0      6543  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950
3  0.178666  0.906861  0.352426  0.748274  0.603342
4  0.796913  0.532281  0.972676  0.297624  0.939657

In [43]:
newdf.loc[(newdf['A']<0.3) & newdf['C']>0.1]

            A         B         C         D         E
3    0.178666  0.906861  0.352426  0.748274  0.603342
9    0.044256  0.656559  0.196785  0.473536  0.666306
10    0.15976  0.233642  0.159852  0.671467  0.747531
16   0.274932  0.896341  0.554731  0.120392  0.095665
25   0.152627  0.399700  0.523227  0.588992  0.629595
..        ...       ...       ...       ...       ...
325  0.007075  0.489943  0.847451  0.787698  0.745437
327  0.197174  0.335115  0.316801  0.384179  0.193412
329  0.169079  0.452387  0.037472  0.778799  0.473752
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371

[100 rows x 5 columns]

In [44]:
newdf.head(2)

          A         B         C         D         E
0      6543  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458

In [45]:
newdf.iloc[0,4]

np.float64(0.6364231715769035)

In [46]:
newdf.iloc[[0,1],[1,2]]

          B         C
0  0.319166  0.690719
1  0.579652  0.586463

In [47]:
newdf.head(3)

          A         B         C         D         E
0      6543  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950

In [48]:
newdf.drop([0])

            A         B         C         D         E
1    0.455463  0.579652  0.586463  0.770397  0.462458
2    0.622877  0.084373  0.488963  0.146209  0.987950
3    0.178666  0.906861  0.352426  0.748274  0.603342
4    0.796913  0.532281  0.972676  0.297624  0.939657
5    0.385347  0.846520  0.987270  0.151433  0.374345
..        ...       ...       ...       ...       ...
329  0.169079  0.452387  0.037472  0.778799  0.473752
330   0.66589  0.666190  0.167143  0.763646  0.474444
331   0.03478  0.248195  0.467110  0.752645  0.469592
332  0.281096  0.469452  0.739213  0.530699  0.141371
333  0.778394  0.535520  0.490037  0.865827  0.561360

[333 rows x 5 columns]

In [49]:
newdf.drop(['A','C'],axis=1)

            B         D         E
0    0.319166  0.525020  0.636423
1    0.579652  0.770397  0.462458
2    0.084373  0.146209  0.987950
3    0.906861  0.748274  0.603342
4    0.532281  0.297624  0.939657
..        ...       ...       ...
329  0.452387  0.778799  0.473752
330  0.666190  0.763646  0.474444
331  0.248195  0.752645  0.469592
332  0.469452  0.530699  0.141371
333  0.535520  0.865827  0.561360

[334 rows x 3 columns]

In [50]:
newdf.reset_index(drop = True , inplace = True)

In [51]:
newdf.head(3)

          A         B         C         D         E
0      6543  0.319166  0.690719  0.525020  0.636423
1  0.455463  0.579652  0.586463  0.770397  0.462458
2  0.622877  0.084373  0.488963  0.146209  0.987950

In [52]:
newdf['B']= None

In [53]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: B, Length: 334, dtype: bool